Revit 2027 API
AppearanceAssetElement.GetAppearanceAssetElementByName Method
 Gets an AppearanceAssetElement by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AppearanceAssetElement GetAppearanceAssetElementByName(
	Document doc,
	string name
)
Public Shared Function GetAppearanceAssetElementByName (
	doc As Document,
	name As String
) As AppearanceAssetElement
public:
static AppearanceAssetElement^ GetAppearanceAssetElementByName(
	Document^ doc,
	String^ name
)
static member GetAppearanceAssetElementByName :
        doc : Document *
        name : string -> AppearanceAssetElement
Parameters
doc Document
 Document containing the AppearanceAssetElement.
name String
 Name of the AppearanceAssetElement.
Return Value
AppearanceAssetElement
 The AppearanceAssetElement with the given name, or null if this element does not exist.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace